
## Plan Result (terraform/aws/hitohub/stage)

[CI link](https://github.com/boxp/arch/actions/runs/8847935304)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 1 to change, 2 to destroy.</code></pre>

* Create
  * aws_ecr_lifecycle_policy.hitohub_backend_stage_lifecycle_policy
  * aws_ecr_lifecycle_policy.hitohub_frontend_stage_lifecycle_policy
  * aws_ecr_repository.hitohub_backend_stage
  * aws_ecr_repository.hitohub_frontend_stage
* Update
  * aws_iam_policy.hitohub_stage_gha_policy
* Delete
  * aws_ecr_lifecycle_policy.hitohub_stage_lifecycle_policy
  * aws_ecr_repository.hitohub_stage


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecr_lifecycle_policy.hitohub_backend_stage_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "hitohub_backend_stage_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "limit the number of images to 3"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 3
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "hitohub-backend-stage"
    }

  # aws_ecr_lifecycle_policy.hitohub_frontend_stage_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "hitohub_frontend_stage_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "limit the number of images to 3"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 3
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "hitohub-frontend-stage"
    }

  # aws_ecr_lifecycle_policy.hitohub_stage_lifecycle_policy will be destroyed
  # (because aws_ecr_lifecycle_policy.hitohub_stage_lifecycle_policy is not in configuration)
  - resource "aws_ecr_lifecycle_policy" "hitohub_stage_lifecycle_policy" {
      - id          = "hitohub-stage" -> null
      - policy      = jsonencode(
            {
              - rules = [
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "limit the number of images to 3"
                      - rulePriority = 1
                      - selection    = {
                          - countNumber = 3
                          - countType   = "imageCountMoreThan"
                          - tagStatus   = "any"
                        }
                    },
                ]
            }
        ) -> null
      - registry_id = "839695154978" -> null
      - repository  = "hitohub-stage" -> null
    }

  # aws_ecr_repository.hitohub_backend_stage will be created
  + resource "aws_ecr_repository" "hitohub_backend_stage" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "hitohub-backend-stage"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.hitohub_frontend_stage will be created
  + resource "aws_ecr_repository" "hitohub_frontend_stage" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "hitohub-frontend-stage"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository.hitohub_stage will be destroyed
  # (because aws_ecr_repository.hitohub_stage is not in configuration)
  - resource "aws_ecr_repository" "hitohub_stage" {
      - arn                  = "arn:aws:ecr:ap-northeast-1:839695154978:repository/hitohub-stage" -> null
      - id                   = "hitohub-stage" -> null
      - image_tag_mutability = "IMMUTABLE" -> null
      - name                 = "hitohub-stage" -> null
      - registry_id          = "839695154978" -> null
      - repository_url       = "839695154978.dkr.ecr.ap-northeast-1.amazonaws.com/hitohub-stage" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null

      - encryption_configuration {
          - encryption_type = "KMS" -> null
          - kms_key         = "arn:aws:kms:ap-northeast-1:839695154978:key/8dc4caf6-004e-4bae-a459-1c23f344e721" -> null
        }

      - image_scanning_configuration {
          - scan_on_push = true -> null
        }
    }

  # aws_iam_policy.hitohub_stage_gha_policy will be updated in-place
  ~ resource "aws_iam_policy" "hitohub_stage_gha_policy" {
        id               = "arn:aws:iam::839695154978:policy/hitohub-stage-gha-policy"
        name             = "hitohub-stage-gha-policy"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = "arn:aws:ecr:ap-northeast-1:839695154978:repository/hitohub-stage" -> "arn:aws:ecr:ap-northeast-1:839695154978:repository/hitohub-*-stage"
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "ecr:GetAuthorizationToken",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {}
        # (6 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":321,"Program":"tfcmt","SHA1":"59916d0fdeddbd56189b44107ca2a4e72db3ad31","Target":"terraform/aws/hitohub/stage","Vars":{},"WorkflowName":"pull_request_target"} -->